/*
1. ყველა კენტი რიცხვი 2000-მდე

იპოვეთ ყველა კენტი რიცხვი 0-დან 2000-მდე და გამოიტანეთ ეკრანზე.

მაგალითად:

1
3
5
7
9
11
13
15
და ა.შ.
1999-მდე
*/
console.log('ყველა კენტი რიცხვი 1 დან 2000 მდე') 
for (let odd = 1; odd < 2000; odd += 2) {
    console.log(odd);
}

/*
 2. ყველა ლუწი რიცხვი -2000 მდე

იპოვეთ ყველა კენტი რიცხვი 0-დან  მინუს 2000-მდე და გამოიტანეთ ეკრანზე.

მაგალითად:
-2
-4
-6
ა.შ.
 */
console.log('ყველა ლუწი რიცხვი -2 დან -2000 მდე') 
for (let even = -2; even >= -2000; even -= 2){
    console.log(even);
}
/*
3. ჩექფოინთი

ვართ თამაშში, სადაც გმირი გადაადგილდება 0-კმ დან 100-კმ მდე. ეს ქმედება აღწერეთ for ლუპში.

თამაშს აქვს ჩექფოინთები, 10, 25, 75 და 90 კილომეტრებზე.

თითოეულ ჩექფოინთზე მიღწევისას ეკრანზე გამოიტანეთ:
“გილოცავთ, თქვენ გაიარეთ x კილომეტრიანი ჩექფოინთი”
*/

for (let km = 0; km <= 100; km++){
    if(km == 10) {
        console.log(`გილოცავთ, თქვენ გაიარეთ ${km} კილომეტრიანი ჩექფოინთი`)
    } else if(km == 25) {
        console.log(`გილოცავთ, თქვენ გაიარეთ ${km} კილომეტრიანი ჩექფოინთი`)
    } else if(km == 75) {
        console.log(`გილოცავთ, თქვენ გაიარეთ ${km} კილომეტრიანი ჩექფოინთი`)
    } else if(km == 90) {
        console.log(`გილოცავთ, თქვენ გაიარეთ ${km} კილომეტრიანი ჩექფოინთი`)
    }else{
        console.log(km);
    }
}
/*
4. კენტი რიცხვების ჯამი

დათვალეთ 0-დან 25000-მდე ყველა კენტი რიცხვის ჯამი.
*/
let z = 0;

for (let odd = 1; odd <= 25000; odd += 2) {
    z += odd ;
}
console.log(`კენტი რიცხვების ჯამი ${z}`);
/*
5. ჯამი და ჯამი

დათვალეთ 500-დან 800-მდე კენტი რიცხვის და 1000-დან 2000-მდე ყველა ლუწი რიცხვის ჯამი. 
*/
let a = 0;
for (let odd = 501; odd <= 800; odd += 2){
     a += odd;
}
console.log(`500 დან 800 მდე კენტი რიხცვების ჯამი ${a}`);

let b = 0;
for (let even = 1000; even <=2000; even += 2){
    b += even;
}
console.log(`1000 დან 2000 მდე ლუწი რიცხვების ჯამი ${b}`);

console.log(`500 დან 800 მდე ყველა კენტი რიცხვის და 1000 დან 20000 მდე ყველა ლუწი რიცხვის ჯამი = ${a + b}`);

/*
6. მათემატიკური ფაქტორიალი

რიცხვის ფაქტორიალი არის 1-დან ამ რიცხვამდე ყველა რიცხვის ნამრავლი.
მაგალითად 5! ანუ, 5-ის ფაქტორიალი არის 1 * 2 * 3 * 4 * 5 = 120

მოცემული გვაქვს ცვლადი let x (number) სადაც 1-დან + უსასრულობამდე ნებისმიერი რიცხვი შეიძლება ეწეროს.

დათვალეთ x-ის ფაქტორიალი.
*/
let number = 5;

let factorial = 1;

for (let i = 1; i <= number; i ++ ){
    factorial *=i;
}

console.log(`${number} - ის ფაქტორიალი = ${factorial}`);

/*
7. 300-is გამყოფები

Javascript-ში % ოპერატორი მარცხენა ოპერანდს ყოფს მარჯვენაზე და შედეგის ნაცვლად აბრუნებს ნაშთს.

მაგალითად, 10 % 6 დააბრუნებს 4-ს რადგან 10-ში 6 ჩაეტია ერთხელ, ხოლო ნაშთი დარჩა 4.
მაგალითად, 10 % 2 დააბრუნებს 0-ს რადგან 10-ში 2 ჩაეტია ხუთჯერ, ხოლო ნაშთი დარჩა 0

იპოვეთ რიცხვი 300-ის ყველა გამყოფი. (რიცხვის გამყოფი არის რიცხვი, რომელიც უნაშთოდ ყოფს მას). მაგალითად 300-ის ერთერთი გამყოფია 100, რადგან ის ზუსტად 3-ჯერ ეტევა 300-ში და ნაშთი არ რჩება.
*/

let number2 = 300;

for (let separator=1; separator <= number2; separator++){
    if(number2 % separator == 0){
        console.log(separator);
    }
}
/*
8. რიცხვის გამყოფები

მოცემული გვაქვს ცვლადი:

Let x (number) შეიძლება იყოს ნებისმიერი რიცხვი 1-დან პლუს უსასრულობამდე.

იპოვეთ რიცხვის ყველა გამყოფის ჯამი.
*/
let number3=300;
let separatorSum=0;

for (let separator=1; separator <= number2; separator++){
    if(number3 % separator == 0){
        separatorSum += separator;
    }
}
console.log(`${number3} - ის ყველა გამყოფის ჯამი = ${separatorSum}`);

/*
9. მარტივი რიცხვი

მარტივი რიცხვი ეწოდება რიცხვს, რომელიც იყოფა მხოლოდ 1-სა და თავის თავზე.

მოცემული გვაქვს ცვლადი:
Let x (number) შეიძლება იყოს ნებისმიერი რიცხვი 2-დან პლუს უსასრულობამდე.

დაადგინეთ არის თუ არა x მარტივი რიცხვი.
*/

let x2 = 5;
let separatorsAmount=0;

for (let separator=1; separator <= x2; separator++){
    if(x2 % separator == 0){
        separatorsAmount += 1;
    }
}

if(separatorsAmount <=2 ){
    console.log(`${x2} - მარტივი რიცხვია`);
} else {
    console.log(`${x2} - შედგენილი რიცხვია`);
}
